IDEA Open Model
BeamLoadsImportMappingData Class
Compatible with IDEA StatiCa Beta 20.0
 BeamLoadsImportMappingData
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.BeamLoadsImportMappingData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[SerializableAttribute]
public class BeamLoadsImportMappingData
<SerializableAttribute>
Public Class BeamLoadsImportMappingData
The BeamLoadsImportMappingData type exposes the following members.
Constructors
Name | Description
BeamLoadsImportMappingData
 Constructor
Top
Properties
Name | Description
BeamID
 BeamID
CADBeamID
 CADBeamID
CoeffVM_X
 CoeffVM_X
CoeffVM_Y
 CoeffVM_Y
CoeffVM_Z
 CoeffVM_Z
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace